import fs from 'fs'
import path from 'path'

let handler = async (m, { conn }) => {

    // توليد الصور من src/1.jpg إلى src/18.jpg
    let images = []
    for (let i = 1; i <= 18; i++) {
        images.push(path.join(process.cwd(), 'src', `${i}.jpg`))
    }

    // اختيار صورة عشوائية
    let imgPath = images[Math.floor(Math.random() * images.length)]

    // قراءة الصورة من الجهاز
    let imgBuffer = fs.readFileSync(imgPath)

    let str = `
*❃ ────────⊰ ❀ ⊱──────── ❃*
                        *الـمـشـرفـيـن*
*❃ ────────⊰ ❀ ⊱──────── ❃* 

> *◍ منشن*
> *◍ مخفي*
> *◍ طرد*
> *◍ كتم*
> *◍ إضافة*
> *◍ ترقية*
> *◍ تخفيض*
> *◍ حذف*
> *◍ فتح جروب*
> *◍ قفل جروب*
> *◍ تغيير الصورة*
> *◍ لينك*
> *◍ مشرف*
> *◍ إنذار*
> *◍ حذف إنذار*
> *◍ لقب*
> *◍ تسجيل*
> *◍ إزالة*
> *◍ ألقاب*
> *◍ زيارة* 

*❃ ────────⊰ ❀ ⊱──────── ❃*
                      *الحياة الافتراضية*
*❃ ────────⊰ ❀ ⊱──────── ❃* 

> *◍ محفظة*
> *◍ بنك*
> *◍ إيداع*
> *◍ سحب*
> *◍ تسوق*
> *◍ يومي*
> *◍ رانك*
> *◍ بروفايل*
> *◍ سرقة*
> *◍ تحويل*
> *◍ منح*
> *◍ دجاج*
> *◍ قتال*
> *◍ شراء* 

*❃ ────────⊰ ❀ ⊱──────── ❃*
                         *الـتـحـمـيـل*
*❃ ────────⊰ ❀ ⊱──────── ❃* 

> *◍ انستا*
> *◍ خلفيات*
> *◍ فيسبوك*
> *◍ تيك*
> *◍ شغل*
> *◍ تويتر*
> *◍ مانهوا*
> *◍ انمي*
> *◍ بحث*
> *◍ تطبيق*
> *◍ صورة*

*❃ ────────⊰ ❀ ⊱──────── ❃*
                          *الـتـرفـيـه*
*❃ ────────⊰ ❀ ⊱──────── ❃* 

> *◍ اكس*
> *◍ حذف-اكس*
> *◍ تحدي*
> *◍ تحداني*
> *◍ صراحه*
> *◍ بوت*
> *◍ تطقيم*
> *◍ ايدت*
> *◍ فزوره*
> *◍ ورع*
> *◍ خروف*
> *◍ اهبل*
> *◍ جميل*
> *◍ ترت*
> *◍ تف*
> *◍ لاعب*
> *◍ علم*
> *◍ احزر*
> *◍ عين*
> *◍ كت*
> *◍ ميمز*
> *◍ حرف*
> *◍ قلب*
> *◍ نرد*
> *◍ لو*
> *◍ صداقه*
> *◍ نصيحة*
> *◍ حب*
> *◍ هل*
> *◍ ترجم*
> *◍ اقتباس*
> *◍ زواج*
> *◍ طلاق*
> *◍ تاج*
> *◍ حكمه*
> *◍ هايسو*
> *◍ المشنقة*
> *◍ سؤال*
> *◍ توب*
> *◍ شخصية*
> *◍ غباء*
> *◍ شبيهي*

*❃ ────────⊰ ❀ ⊱──────── ❃*
                         *الـتـحـويـل*
*❃ ────────⊰ ❀ ⊱──────── ❃* 

> *◍ ملصق*
> *◍ لنص*
> *◍ قول*
> *◍ لصورة*
> *◍ كومنت*
> *◍ زخرفة*
> *◍ خط*
> *◍ كلمات-اغنيه*
> *◍ تحسين*
> *◍ لفيديو*
> *◍ لصورة*
> *◍ لانمي*
> *◍ باركود*

*❃ ────────⊰ ❀ ⊱──────── ❃*
                            *هايسو*
*❃ ────────⊰ ❀ ⊱──────── ❃* 

> *◍ سماح*
> *◍ منع*
> *◍ لائحة*
> *◍ بان*
> *◍ بان-فك*
> *◍ ايقاف*
> *◍ تشغيل*
> *◍ افتار*
> *◍ ريستارت*
> *◍ ادخل*
> *◍ اخرج*
> *◍ ضيف-اكس-بي*

*❃ ────────⊰ ❀ ⊱──────── ❃*
                          *الألــقــاب*
*❃ ────────⊰ ❀ ⊱──────── ❃* 

> *◍ القاب*
*❃ ⌘¦ قائمة بجميع الألقاب ❃* 
> *◍ تسجيل*
*❃ ⌘¦ منشن عضو لتسجيله ❃*
> *◍ تصفيه*
*❃ ⌘¦ حذف جميع الألقاب ❃*
> *◍ لقبي*
*❃ ⌘¦ لمعرفة لقبك ❃* 
> *◍ لقبه*
*❃ ⌘¦ معرفة لقب العضو الذي تم منشنته ❃* 
> *◍ لقب*
*❃ ⌘¦ بحث عن اللقب وتوفره ❃*
> *◍ حذف*
*❃ ⌘¦ حذف اللقب المسجل ❃*  

*❃ ────────⊰ ❀ ⊱──────── ❃*`

    await conn.sendMessage(
        m.chat,
        { image: imgBuffer, caption: str },
        { quoted: m }
    )
}

handler.help = ['main']
handler.tags = ['group']
handler.command = /^(كل-الاوامر)$/i

export default handler
