let handler = async (m, { conn, command }) => {
    let formText = "";
    let formText1 = "";

    switch (command) {
        case "بيتا_ترحيب":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

 مرحباََ بك في نقابة سبارتا
              ⊰🌨️⊱
  ⚜︎يسرنا تواجدك بيننـا⚜︎
      وانضمامك معنــا و
بكـل ما تحمله معاني الشـوق
⚜︎نتلهف لقراءة مشاركاتك⚜︎
━─┄⊹⊱ «◈» ⊰⊹┄─━
 
*✧ ♟️┋اللـــقـــب • 〘〙*

*✧ 📧┋المـــنشـن • 〘〙*

*✧ 🧑🏻‍💻┋المسؤول  • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

  ◈ ⚜︎  قـروب الإعـلانـات 🗞️ ↯↯.
〘 https://2u.pw/63sSx 〙

◈ ⚜︎ قوانين النقابة 📋 ↯↯.
〘 https://bit.ly/4aH5fO2 〙

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "استمارة":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋قم بتعبئة الإستمارة┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 🎎┋إختر شخصية • 〘〙*

*✧ 🧧┋الشخصية من اي عمل • 〘〙*

*✧ ❓┋ولــد أو بـنــت • 〘〙*

*✧ 📯┋من طرف مين • 〘〙* 

*✧📸┃صورة للشخصية :-*
 
━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═`;
        formText1 = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

نبذة عن القروب هذا
القروب يشمل جميع اهتماماتك مثل الأنمي، كرة القدم، المسلسلات، الألعاب، وغيرها من المواضيع الممتعة. القروب عبارة عن مساحة للسوالف، النقاشات، الفعاليات، وأجواء مميزة مليئة بالجوائز والتفاعل.

ولكن هذا القروب مجرد استقبال للقروب الأساسي، وقوانينه صارمة! يمنع فيه السوالف، وإذا ما عبيت الاستمارة خلال 24 ساعة، سيتم طردك.
القروب الأساسي يحتوي على أكثر من 180 عضو متفاعلين، أجواءهم رهيبة، وسوالفهم ممتعة.

━─┄⊹⊱ «◈» ⊰⊹┄─━`;
            break;

        case "استماره":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋قم بتعبئة الإستمارة┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 🎎┋إختر شخصية • 〘〙*

*✧ 🧧┋الشخصية من اي عمل • 〘〙*

*✧ ❓┋ولــد أو بـنــت • 〘〙*

*✧ 📯┋من طرف مين • 〘〙* 

*✧📸┃صورة للشخصية :-*
 
━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗`;
        formText1 = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

نبذة عن القروب هذا
القروب يشمل جميع اهتماماتك مثل الأنمي، كرة القدم، المسلسلات، الألعاب، وغيرها من المواضيع الممتعة. القروب عبارة عن مساحة للسوالف، النقاشات، الفعاليات، وأجواء مميزة مليئة بالجوائز والتفاعل.

ولكن هذا القروب مجرد استقبال للقروب الأساسي، وقوانينه صارمة! يمنع فيه السوالف، وإذا ما عبيت الاستمارة خلال 24 ساعة، سيتم طردك.
القروب الأساسي يحتوي على أكثر من 180 عضو متفاعلين، أجواءهم رهيبة، وسوالفهم ممتعة.

━─┄⊹⊱ «◈» ⊰⊹┄─━`;
            break;

        case "بيتا_حسبة":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

حسبة الفعاليات
( مثل فعالية قلوب او فعالية طرد وفيه فعاليات كثيره )


مثلاً نقول شاركو 10


المقدم ياخذ 6k ضرب عدد المشاركين
6k × 10 = 60k

المركز الاول يكون اقل من المقدم بـ 5k
= 55k

المركز الثاني اقل من المركز الاول بـ 5k
=50k

المركز الثالث اقل من المركز الثاني بـ 5k
=45k

باقي المشاركين ياخذون 1k ضرب عدد المشاركين
1k × 10 = 10k

━─┄⊹⊱ «◈» ⊰⊹┄─━
         حسبة المسابقات 

نقول مثلاً سويت 50 سؤال

المقدم ياخذ 800 ضرب عدد الاسئلة
800 × 50 = 40k

المركز الاول 700 ضرب عدد الاسئلة 
700 × 50 = 35k

المركز الثاني 600 ضرب عدد الاسئلة
600 × 50 = 30k

المركز الثالث 500 ضرب عدد الاسئلة 
500 × 50 = 25k

باقي المشاركين ياخذون 100 ضرب عدد الاسئلة
100 × 50 = 5k

━─┄⊹⊱ «◈» ⊰⊹┄─━
     حسبة الأسئلة المفاجأة 

سهل 5k
متوسط 10k
صعب 15k
صعب جداً 20k

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_01":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋أستماراتـ الأساسيه┋◆
 ━─┄⊹⊱ «◈» ⊰⊹┄─━

 ⚜︎┊ا استمارة *سؤال مفاجئ*  اطلب 
✧ بيتا س1      
    
┄⟞❲❉❳⟝┄

 ⚜︎┊ا استمارة *الإجابة*  اطلب 
✧ بيتا ج1 

┄⟞❲❉❳⟝┄

 ⚜︎┊ا استمارة *المسابقة*  اطلب 
✧ بيتا مسابقة

┄⟞❲❉❳⟝┄

 ⚜︎┊ا استمارة *النتائج*  اطلب 
✧ بيتا نتائج 

┄⟞❲❉❳⟝┄

⚜︎┊ا استمارة *الفعاليات*  اطلب 
✧ بيتا فعالية
 
┄⟞❲❉❳⟝┄

 ⚜︎┊ا استمارة *جوائز*  اطلب 
✧ بيتا جوائز 
  
┄⟞❲❉❳⟝┄

⚜︎┊ا استمارة *جوائز الفرق* اطلب
✧بيتا فرق

┄⟞❲❉❳⟝┄

 ⚜︎┊ا استمارة *المشاركين*  اطلب 
✧ بيتا مشاركين 

┄⟞❲❉❳⟝┄

  ⚜︎┊ا استمارة *نقاش*  اطلب 
✧ بيتا نقاش 

┄⟞❲❉❳⟝┄

  ⚜︎┊ا استمارة *إنتهى النقاش*  اطلب 
✧ بيتا انتهى 

┄⟞❲❉❳⟝┄

⚜︎┊استمارة *سؤال ديني*  اطلب
✧ بيتا سؤال ديني

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_02":
            formText = `┐═━━━━✥◈✥━━━━═┌
        
⚜︎🛎️┊استمارات البطولات┊🛎️⚜︎

  ━━━─── • ───━━━


 ⚜︎┊ا استمارة *فعالية الصور*  اطلب 
✧بيتا ف1
    
- - ❲❉❳ - -

 ⚜︎┊ا استمارة *فعالية تحدي فردي*  اطلب 
✧بيتا ف2 

- - ❲❉❳ - -

 ⚜︎┊ا استمارة *فعالية الساحة*  اطلب 
✧بيتا ف3

- - ❲❉❳ - -

 ⚜︎┊ا استمارة *فعالية الزومبي*  اطلب 
✧بيتا ف4 

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية كرسي الاعتراف*  اطلب 
✧بيتا ف5
  
- - ❲❉❳ - -

 ⚜︎┊ا استمارة *فعالية روليت الأسئلة*  اطلب 
✧بيتا ف6
  
- - ❲❉❳ - -

 ⚜︎┊ا استمارة *فعالية تحدي سبام*  اطلب 
✧بيتا ف7

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعالية القلوب*  اطلب 
✧بيتا ف8

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعالية الكنز*  اطلب 
✧بيتا ف9

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعالية الطرد*  اطلب 
✧بيتا ف10

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعالية ديث نوت*  اطلب 
✧بيتا ف11

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعالية قتال العظماء*  اطلب 
✧بيتا ف12

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعاليه البكتيريا*  اطلب 
✧بيتا ف13

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعاليه المنشن*  اطلب 
✧بيتا ف14

- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعاليه الادت*  اطلب 
✧بيتا ف15
- - ❲❉❳ - -

  ⚜︎┊ا استمارة *فعاليه الاجراس*  اطلب 
✧بيتا ف16

- - ❲❉❳ - -

 ⚜︎┊ا استمارة *فعالية الابواب* اطلب
✧بيتا ف17

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية واقف جالس* اطلب
✧بيتا ف18

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية القدرات* اطلب
✧بيتا ف19

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية القلاع* اطلب
✧بيتا ف20

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية الكيرا* اطلب
✧بيتا ف21

- - ❲❉❳ - -

⚜︎┊ا استمارة *البقاء للأقوى* اطلب
✧بيتا ف22

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية المارد الازرق* اطلب
✧بيتا ف23

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية الجواهر* اطلب
✧بيتا ف24

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية الميمز* اطلب
✧بيتا ف25

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية إكس آو* اطلب
✧بيتا ف26

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية الكلانات* اطلب
✧بيتا ف27

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية مصاص الدماء* اطلب
✧بيتا ف28

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية المعرفة* اطلب
✧بيتا ف29

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية صراع الآباطرة* اطلب
✧بيتا ف30

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية سلب الكرات* اطلب
✧بيتا ف31

- - ❲❉❳ - -

⚜︎┊ا استمارة *فعالية التعداد* اطلب
✧بيتا ف32

- - ❲❉❳ - -

    ━━━─── • ───━━━ 
          
        ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

 ┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_03":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋استمارات إداريـة┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

⚜︎┊استمارة *تغيير اللقب*  اطلب 
✧بيتا ا1
    
- - ❲❉❳ - -
⚜︎┊استمارة *الانذار*  اطلب 
✧بيتا ا2

- - ❲❉❳ - -
⚜︎┊استمارة *طرد*  اطلب 
✧بيتا ا3

- - ❲❉❳ - -
⚜︎┊استمارة *تحويل بيلي*  اطلب 
✧بيتا ا4

- - ❲❉❳ - -
⚜︎┊استمارة *ازاله انذار*  اطلب 
✧بيتا ا5
  
- - ❲❉❳ - -
⚜︎┊استمارة *شراء*  اطلب 
✧بيتا ا6
  
- - ❲❉❳ - -
⚜︎┊استمارة *ترقية*  اطلب 
✧بيتا ا7

- - ❲❉❳ - -
⚜︎┊استمارة *تخفيض*  اطلب 
✧بيتا ا8

- - ❲❉❳ - -
⚜︎┊استمارة *حجز لقب*  اطلب 
✧بيتا ا9

- - ❲❉❳ - -
⚜︎┊استمارة *مهام المشرفين*  اطلب 
✧بيتا ا10

- - ❲❉❳ - -
⚜︎┊استمارة *تقييم المشرفين*  اطلب 
✧بيتا ا11

- - ❲❉❳ - -
⚜︎┊استمارة *ملوك الاسبوع*  اطلب 
✧بيتا ا12

- - ❲❉❳ - -
⚜︎┊استمارة *تقرير النقابه*  اطلب 
✧بيتا ا13

- - ❲❉❳ - -
⚜︎┊استمارة *التفاعل الاسبوعي*  اطلب 
✧بيتا ا14

- - ❲❉❳ - -
⚜︎┊استمارة *ملوك المسابقات*  اطلب 
✧بيتا ا15

- - ❲❉❳ - -
⚜︎┊ استمارة *روليت*  اطلب 
✧بيتا ا16

- - ❲❉❳ - -
⚜︎┊استمارة *ارسال رساله بالاعلانات*  اطلب 
✧بيتا ا17

- - ❲❉❳ - -
⚜︎┊استمارة *اعلان سلعه قتاليه*  اطلب 
✧بيتا ا18

- - ❲❉❳ - -
⚜︎┊استمارة *اعلان الإداره العليا*  اطلب 
✧بيتا ا19

- - ❲❉❳ - -
⚜︎┊استمارة *المهام الاساسيه* اطلب
✧بيتا ا20

- - ❲❉❳ - -
⚜︎┊استمارة *تحديث البنك* اطلب
✧بيتا ا21

- - ❲❉❳ - -
⚜︎┊استمارة *تفاعل المشرفين* اطلب
✧بيتا ا22

- - ❲❉❳ - -
⚜︎┊استمارة *نظام التقييم* اطلب
✧بيتا ا23

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_س1":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋ســؤال مفـاجــئ┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧🏮 ┋الســؤال • 〘〙*

*✧ 🧮┋الصعوبة • 〘〙*

*✧⏳ ┋الـوقـــت • 〘〙*

*✧💸 ┋الجائــزة • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ج1":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعـلان الإجــابـة ┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧🎖️ ┋ الفــائــز •〘〙*

*✧💸 ┋ الـجائزه •〘〙*

*✧🎯 ┋ الجواب •〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_سؤال_ديني":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋سؤال ديني مفاجئ┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 📜┋الــســؤال• ⤺*
☚  

*✧ 📝┋ملاحظات• ⤺*

➀ مدة ألإجابه 5 دقائقـ..✎
➁ الاجابة بالقروب الاساسي.
 
━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗<`;
        formText1 = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋اعــلان الاجـابـــة┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 📯┋الاجابة• ⤺*
☚  

*✧ 👤┋المجيب• ⤺*
☚  
 
━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗`;
            break;

        case "بيتا_نقاش":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋سؤالــ🧧ــنقاش┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧❓ ┋السؤال • 〘〙*

*✧⏱️ ┋الـمــدة • 〘〙*

*✧ 🥇┋ابرز المناقــشين • 〘30k〙*

*✧🏅 ┋باقي المناقشين • 〘10k〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_انتهى":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋انتهى الـ⏰ـنقاش┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧🥇 ┋ابرز الـمناقـشين • 〘〙*

*⚜︎.الجـائـزه   :「30k*

┄⟞❲❉❳⟝┄

*✧ 🏅┋باقي المناقشين • 〘〙*

*⚜︎.الجائزه  :「10k*

┄⟞❲❉❳⟝┄

 *✧ 🎙️┋المقدم • 〘〙*

*⚜︎.الجائزه  :「20k*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "شرح":
            formText = `*☬بسم الله الرحمن الرحيم☬*

 *〖شرح النقابة وما تحتوي〗*

*☜ القوانين ♗*

『تتكون النقابة من عدة قوانين يجب الالتزام بها وذلك ل الحفاظ على امن القروب وعدم تضايق الاعضاء يمكنك ان تقرأ القوانين من خلال كتبك *{القوانين}* وستظهر القوانين 』


*☜ الانذارت ω*

『في حال احد خالف القوانين سيتم تحذيره في بداية الامر من المشرفين واذ تكرر بيتم اعطها انذار بكل بساطة والانذار معروف بيكون كا تحذير اذ كرر بياخذ انذار غيره لين يصل ل الطرد 』


*☜ الطرد ♧*

『اذ صار عندك اكثر من انذار سيتم طردك يومين كا تاديب لك واذ سويت اشياء كا النشر او الاباحيه سيتم طردك مؤبد ومابترجع ويوجد تفاصيل اكثر بالقوانين 』


*☜ البيلي ￡*

『البيلي هي فلوس وهميه خاصة بالقروب ويمكنك انك  تشتري فيه اشياء موجوده في متجر القروب او تحول ل الناس وله استخدامات كثير ومنها حذف انذار شراء سلعة وغيرها』


*☜ طريقة الحصول على بيلي ☫*

『الامر بسيط في القروب يوجد فعاليات ومسابقات كل اللي عليك تشارك فيها وتفوز وتحصل البيلي حتى مشاركتك تحصل فيها بيلي 』


*☜ البنك ♞*

『بختصر هو معروف مكان ل حفظ الفلوس فلوسك اللي تحصل عليها راح تكون كلها هناك يمدي تشوف كم عندك وغيرهه من خلال رابط البنك الموجود بوصف الاعلانات 』


*☜ المتجر ㋡*

『متجر خاص بنقابة وفيها اكثر من شيء تقدر تشتريه بل البيلي اللي تجمعه مثل ، طرد شخص ، تغير افتار القروب ، شراء حماية وغيرها من الاشياء القيمه ، وطبعا سعر الشيء موجود بجنبه ، الرابط بوصف الاعلانات 』


*☜ الفعاليات ღ*

『بختصار في فعاليات متنوعه موجوده في القروب للترفيه مثل ديث نوت ، الطرد ، القلوب وغيرهة من الفعاليات القيمه تقدر تقدم فعالية وتكسب فلوس بس تقول ل مشرف ابيي اقدم فعالية طرد مثلا وتقدر تشارك وتكسب فلوس من مشاركتك للاستفسار عن الفعاليات اسال ايي مشرف 』


*☜ الترقيات ✿*

『طبعا تفاعلك المستمر في  القروب بيعطيك فرصة انك تترقى ل مشرف او تترقى ل مسوؤل بنك وبس ذي الترقيات باختصار 』


*☜ الفروع ❀*

『تحتوي المملكة على فروع كثيرة ومتميزة يمكنكم الاستفادة منها . من فروعنا ، الافتار ، الاستيكر ، يمكنكم الاستفادة منها من خلال الدخول لها وطلب الافتار اللي تبيه  من مشرف الفرع والمشرف بيرسل لك الافتار اللي طلبته دا كا مثال او تطلب اسيتكر خاص ل روبين مثلا ويرسل لك المشرف حق الفرع طبعا تلقوا الفروع ب موقع النقابة 』


*☜ موقع النقابة ►♡*

『موقع النقابة يوجد فيها البنك والمتجر و الفروع الخاصة بالمملكة او النقابة وتلقون رابط الموقع بالاعلانات 』

≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃≃

*☜ مع تحيات مملكة☞*

*❧𝑨𝒋𝒂𝒓𝒔🌨️♕*
`;
            break;

        case "بيتا_مسابقة":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعـلان مـسـابقـة ┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 🏮┋ نـوع المسـابقة •〘〙*

*✧ 🎰┋ عـدد الأسـئـلـة •〘  〙*

*✧⏳ ┋ الـوقــت •〘الآن〙* 

*✧ 🎙️┋ الـمـقـدم •〘 〙* 

━─┄⊹⊱ «◈» ⊰⊹┄─━

*❁ 📝┊ملاحظات•*

➀ إرسال صور أو مقاطع وقت المسابقة يعرضك للتنبيه بعدها انذار في حال تكرار .
➁ الاعتراضات بعد المسابقة.
➂ التكليج غير محسوب.

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_نتائج":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋جوائـز مـسـابقـة┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━
*✧🥇┋المـركز الاول*
»〘 | 〙

┄⟞❲❉❳⟝┄
 *✧🥈┋المركز الثاني*
»〘 | 〙

┄⟞❲❉❳⟝┄
 *✧🥉┋المركز الثالث*
»〘 | 〙

┄⟞❲❉❳⟝┄
*✧ 🏅┋المشاركين •*〘〙

»〘〙
»〘〙
»〘〙
»〘〙

┄⟞❲❉❳⟝┄

*✧ 🎙️┋ المـقدم •〘〙*

*✧ 💸┋ الجائزة •〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_فعالية":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑨𝒊𝒂𝒓𝒔 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_جوائز":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋جـوائــز الفعالية ┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━
*✧🥇┋المـركز الاول*
»〘 | 〙

┄⟞❲❉❳⟝┄
 *✧🥈┋المركز الثاني*
»〘 | 〙

┄⟞❲❉❳⟝┄
 *✧🥉┋المركز الثالث*
»〘 | 〙

┄⟞❲❉❳⟝┄
*✧ 🏅┋المشاركين •*〘〙

»〘〙
»〘〙
»〘〙
»〘〙

┄⟞❲❉❳⟝┄

*✧ 🎙️┋ المـقدم •〘〙*

*✧ 💸┋ الجائزة •〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_فرق":
            formText = `┐═━━━━✥◈✥━━━━═┌

⚜︎♟️تـعـلن إدارة 𝑨𝒊𝒂𝒓𝒔 عـن :-

❁ 🏆┇ جوائز الفعالية┇🏆❁ 

•┈「❁」┈•

❁ المقدم 🎙️「 | 」

❁ الفريق الفائز 🥇┇┇
〖 𝟏 / @ 〗
〖 𝟐 / @ 〗
〖 𝟑 / @ 〗
〖 𝟒 / @ 〗

•┈「❁」┈•
❁ الفريق الخاسر🥈┇┇
〖 𝟏 / @ 〗
〖 𝟐 / @ 〗
〖 𝟑 / @ 〗
〖 𝟒 / @ 〗
━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_مشاركين":
            formText = `*⊱┈┄┅┅━• ｢•🌨️•｣ ━┅┅┈┈⊰*

❂🎙️┃ الــــمقــدم ｢｣

❂ نـوع الـمـسابـقـة ｢｣

❂ عــدد الأســئـلـة  ｢｣

*⊹──⊱🌨️⊰──⊹*

❂ 🛎️┃ الـمـشـاركـيـن : 

 ❂ ｢اللقب  | النقاط ｣
 ❂ ｢ | ｣
 ❂ ｢ | ｣
 ❂ ｢ | ｣
 ❂ ｢ | ｣
 ❂ ｢ | ｣
 ❂ ｢ | ｣

*⊱┈┄┅┅━• ｢•🌨️•｣ ━┅┅┈┈⊰*
`;
            break;

        case "بيتا_ف1":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الصور」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「اي شخص يبي يشارك يرسل صورة للمقدم بالخاص ، وعند بدء الفعالية المقدم بيحط صورتين من صور المشاركين والاعضاء راح يصوتو للصوره الافضل والصوره الاكثر تصويت يتأهل وعلى ذا النظام حتى يبقى صوره وحده وممنوع تلمح عن الصوره حقتك.」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف2":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「تحدي فردي」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「٢٠ سؤال تحدي فردي يقام بين عضوين بعد الاتفاق بينهم على مبلغ معين ، يتم اعطاء الجائزه للفائز بينما يتم خصمها من الخاسر❗」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「2」

❁ 🎫┊المبلغ المراهن عليه »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف3":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الساحة」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「راح يكون عبارة عن افرقة وكل فريق يمتلك شخصين وتبدا الفعالية ويتواجه كل فريق ضد فريق اخر وراح يكون عبارة عن 5 اسئلة والفريق الفائز يتاهل للجولة الي بعده واخر فريق يبقى هو الفائز」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
            break;

        case "بيتا_ف4":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الزومبي」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「حـرب بين فريقين ٨ زومبي و٨ بشر ، يتحول البشري الى زومبي اذا اجاب الزومبي ويختار الزومبي من يريده من البشر لتحويله لزومبي والعكس اذا اجاب البشر يمكنه تحويل اي مشارك يريده الى بشري💫」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
        formText1 = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الساحة」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「راح يكون عبارة عن افرقة وكل فريق يمتلك شخصين وتبدا الفعالية ويتواجه كل فريق ضد فريق اخر وراح يكون عبارة عن 5 اسئلة والفريق الفائز يتاهل للجولة الي بعده واخر فريق يبقى هو الفائز」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
            break;

        case "بيتا_ف5":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「كرسي الاعتراف」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「 يرشح الاعضاء انفسهم بمقابل ، ويُختار احدهم بالقرعة ليُسأل من قبل جميع الاعضاء خلال ٢٠ دقبقة يفوز المرشح اذا اجاب عن جميع الاسئلة💫」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف6":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「روليت الأسئلة」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「 نلف الروليت واذا جاء عليك الروليت تختار واحد من المشاركين ينسأل سؤال اذا ما جاوب على السؤال ينطرد من الروليت وتستمر المسابقة كذا حتى تنتهي」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「اللقب / المنشن」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف7":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「تحدي سبام 」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「بنسوي قروب 
اكثر واحد يجيب رسائل كثير هو الفائز مدة التحدي 3min」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

❁ 🖇️┊رابط الـقـروب 
»「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف8":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「القلوب」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「 كل شخص لديه ثلاث قلوب بس ما تدري مين وراء كل قلب تقوم بحذف الثلاث قلوب لطرده قد يكون الشخص الذي تطرده هو نفسك اخر واحد يبقا هو الفائز  

✧💡 الطريقة:

  تست عادي صور ، كتابة و إلخ..」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

 
━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
        formText1 = `┐═━━━━✥◈✥━━━━═┌

⚜︎♟️تـعـلن إدارة 𝑨𝒊𝒂𝒓𝒔 عـن :-

❁ 🏆┇ جوائز الفعالية┇🏆❁ 

•┈「❁」┈•

❁ المقدم 🎙️「 | 」

❁ الفريق الفائز 🥇┇┇
〖 𝟏 / @ 〗
〖 𝟐 / @ 〗
〖 𝟑 / @ 〗
〖 𝟒 / @ 〗

•┈「❁」┈•
❁ الفريق الخاسر🥈┇┇
〖 𝟏 / @ 〗
〖 𝟐 / @ 〗
〖 𝟑 / @ 〗
〖 𝟒 / @ 〗
━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
            break;

        case "بيتا_ف9":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الكنز」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「- عند حصولك على 5 نقاط يمكنك الوصول الى الصندوق أو الكنز
- الصندوق يحتوي على جوائز يحددها المقدم 
- جمع النقاط عن طريق المشاركة في الفعالية」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
        formText1 = `┐═━━━━✥◈✥━━━━═┌

⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

❁ 🏆┇ جوائز الفعالية┇🏆❁ 

•┈「❁」┈•

❁ المقدم 🎙️「 |」

❁المشاركين ┇🏆┇

〖/〗
〖/〗
〖/〗
〖/〗
━━━─── • ───━━━

        ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
            break;

        case "بيتا_ف10":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الطرد」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「بنسوي قروب وبعدين المقدم يعطي الكل إشراف وتبدأ طرد」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب » 「」

❁ 🖇️┊رابط الـقـروب 
»「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف11":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「دث نوت」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「يقوم المقدم بطرح الاسئله كتابه،صور،..الخ و حينما يوجيب شخص  يقوم باختيار احد من المشاركين لطرده من الفعاليه」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف12":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「قتال العظماء」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「فعاليه بين اثنين الحكم يرسل صوره او كتابه ،تفكيك و ... الي يجاوب ١٠ مرات صح راح يقدر يامر الثاني بشي واحد من الاوامر التاليه*

1 : غير المنشن حقك لمده يوم الا ....
2 : غير صورت البروفايل حقك لمده يوم الا ...
3 : سجل فويس تغني
4 : سجل فويس اوني تشان
5 :يمنشن واحد من اختيارك و يقوله الشئ الي تامره به
6 : طرد ثلاث ساعات
7 : تحويل بيلي اقل من 100k
و اذا ما وافق على الامر يخصم منه 100k」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف13":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「البكتيريا」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「مسابقة البكتيريا

*كل شخص لديه 10 بكتيريا🦠*

• *عندما تفوز ب نقطة تزيل بكتيريا 1  عنك*

• *عندما يجمع اي مشارك 5 نقاط، يحق له زيادة 3 بكتيريا الى مشارك اخر.*

*اي مشارك تتزايد البكتيريا الضاره إلى 16 يستبعد من المسابقه*

• *الشخص الاول الذي يتخلص من كل البكتيريا يعتبر الفائز*」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف14":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「المنشن」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「كل الي في الفعاليه يقولون القابهم والمشرف يجيب صوره لواحد من الالقاب واول واحد يمنشن صاحب اللقب ياخذ نقطه」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「10+」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف15":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الادت」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「اي شخص يبي يشارك يرسل ادت للمقدم بالخاص ، اقصى حد للادت دقيقه واحده ومو شرط يكون الادت حقك ، وعند بدء الفعالية المقدم بيحط ادتين من ادتات المشاركين والاعضاء راح يصوتو للادت الافضل والادت الاكثر تصويت يتأهل وعلى ذا النظام حتى يبقى ادت واحد وممنوع تلمح عن الادت حقك.」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف16":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الاجراس」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「يقوم المقدم بطرح الاسئله كتابه،صور،..الخ و اول شخص يرسل جرس🛎️ بامكانة الاجابة على السؤال المطروح و اذا كان الجواب غلط يتجمد الشخص دور الثاني بما يعني لا يمكنة الاجابة 」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف17":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الابواب」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「 المقدم يضع 15 باب و 3 منها صحيحه والباقي خاطئ 
وتبدا الفعاليه كالآتي : صور ، كتابه ، الخ..
واول شخص يجيب على الاسئله يختار احدى الابواب وعندما يكون الباب الصحيح يفوز وعندما يكون الباب الخاطئ يكمل الفعاليه والفعاليه فيها ثلاث فائزين فقط وبعدها تنتهي الفعاليه 」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة : 

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف18":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「واقف جالس」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「يكتب المقدم “ واقف او جالس “ بشكل عشوائي و المشاركين يرسلون الايموجيات المناسبه للموقف ، اخر شخص يحصل على اكس ، وعند الحصول على 3 اكسات يتم اقصاءه من الفعالية ، وايضاً عند عدم الإجابه ستحصل على اكس ، واخر شخص يبقى هو الفائز  
واقف = 🧍
جالس = 🪑」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف19":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「القدرات」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「قدرة الجليد ❄️ : تمتلك 6 قلوب لكن تدمج قلب واحد

قدرة النار 🔥: يمتلك 3 قلوب لكن عند الاجابه يمكنه ان ينقص قلبين من اي شخص

قدرة السحر 🔮 : تمتلك 3 قلوب لكن تدمج قلب وعند الاجابه يمكنه زيادة قلوبه او ان ينقص قلب من شخص ثاني الحد الاقصى لقلوبه 5

قدرة البرق⚡️: يمتلك 4 قلوب لكن عند الاجابه يمكنه ان ينقص من شخصين وكل شخص قلب

واذا خلصت قلوبك تخسر ، واخر شخص يبقى بالفعاليه هو الفائز

وللتنبيه :- الحد الاقصى للمشاركين في امتلاك القدرات هي ربع المشاركين 
مثلاً شارك 12 كل قدره يمكن لثلاث اشخاص اخذها 」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف20":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「القلاع」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「يتقسم المشاركين الى فرق كل فريق مكون من اثنان وكل فريق يمتلك ثلاث قلاع ، عندما تجيب يمكنك اما ان تنقص قلعه من قلاع الفرق الاخرى او تزيد من قلاعك و اقصى حد لزياده القلاع هو اربعة قلاع」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف21":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الكيرا」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「بيسوي المقدم قروب ويدخل المشاركين ، 
وبيختار احد المشاركين ليكون كيرا وبيعلمه بالخاص وعلى المشاركين معرفة من الكيرا ، وعلى الكيرا ابعاد الشبهات عنه لكي يفوز
وراح يفتح المقدم القروب والمشاركين راح يتشاورون فيما بينهم ويسألون بعض لمعرفة الكيرا وبعدها سيغلق المقدم القروب والاكثر تصويت يخرج برا الفعاليه واذا كان الكيرا تنتهي الفعاليه بفوز المشاركين واذا كان احد المشاركين سيكمل الفعاليه حتى تنتهي فوز الكيرا او بفوز المشاركين」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف22":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「البقاء للأقوى」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「راح يسوي المقدم قروب ويدخل المشاركين ، بعدها المقدم بيفتح القروب ويبدا المشاركين يمنشنون بعض حتى يقفل المقدم القروب واخر مشارك تم منشنته سيتم طرده وبعدها سيتم اكمال الفعاليه حتى يبقى شخص واحد وسيكون هو الفائز」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف23":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「المارد الازرق」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「المقدم بيفكر بشخصية معينه وأنت خمن اسم الشخصيه بـ انك تسأل المقدم اسئله عن الشخصيه مثل ( الشخصيه من انمي ون بيس ، الشخصيه ولد والخ ) والمقدم بيجاوب بـ نعم او لا فقط ، وعند الإجابه الصحيحه يمكنك طرد احد المشاركين.」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
        formText1 = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「المارد الازرق」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「المقدم بيفكر بشخصية معينه وأنت خمن اسم الشخصيه بـ انك تسأل المقدم اسئله عن الشخصيه مثل ( الشخصيه من انمي ون بيس ، الشخصيه ولد والخ ) والمقدم بيجاوب بـ نعم او لا فقط ، وعند الإجابه الصحيحه ستحصل على نقطه.」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└`;
            break;

        case "بيتا_ف24":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الجواهر」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「كل مشارك له 3 جواهر 💎 
وتبدأ الفعالية والمقدم يرسل صورة إيموجي معين وعلى المشاركين ارسال نفس الإيموجي واول شخص يرسل الإيموجي الصحيح يستطيع إزالة جوهره من احدى المشاركين ، واخر شخص يبقى هو الفائز」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف25":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الميمز」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「اي شخص يبي يشارك يرسل ميمز للمقدم بالخاص ، اقصى حد للميمز دقيقه واحده ، وعند بدء الفعالية المقدم بيحط ميمزين من ميمزات المشاركين والاعضاء راح يصوتو للميمز المضحك اكثر والميمز الاكثر تصويت يتأهل وعلى ذا النظام حتى يبقى ميمز واحد وممنوع تلمح عن الميمز حقك.」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف26":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「إكس آو」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「يلعب شخصين في القروب ضد بعض الأول إكس ❌ والثاني أو ⭕ ويتم اللعب بتعبئه المربعات بإما ❌ أو ⭕ واللاعب الذي ينجح بتكوين 3 رموز متشابهة عمودياً أو أفقياً أو بشكل قطري يكون هو الفائز ويتأهل للجولة الي بعدها وتنتهي الفعالية ببقاء شخص واحد فقط وسيكون هو الفائز」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف27":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「الكلانات」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「عبارة عن فريقين ، الفريق الاخضر 🟩 والفريق الاحمر 🟥 ويتواجه كل لاعب من الفريقين ضد لاعب من الفريق الثاني وتكون عبارة عن خمس اسئلة والفائز يتأهل ويلعب ضد لاعب ثاني من فريق الخصم والخاسر يخرج ، والفريق الذي ينتهي لاعبينه اول يعتبر هو الفريق الخاسر والفريق الثاني هو الفائز」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف28":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「مصاص الدماء」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「كل اربع بشريين يقابلهم مصاص دماء واحد والمقدم هو من يحدد مصاص الدماء ، ومصاص الدماء يمتلك خمس قلوب سوداء والبشريين يمتلكون قلبين فقط ، وعند الإجابه الصحيحه لـ مصاص الدماء يستطيع ازالة قلب من احدى البشريين وعند انتهاء قلوبه يخسر واما عند الإجابه الصحيحه للبشريين يحصلون على نقطه وعند الحصول على نقطتين يستطيعون ازالة قلب من مصاص الدماء ، وعند انتهاء البشريين يفوز مصاص الدماء والعكس صحيح」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف29":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「المعرفة」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「المقدم يختار حرف وعلى المشاركين الإجابة بأسم شخصية انمي و حيوان و جماد و نبات و بلاد يبدون بنفس الحرف الذي قاله المقدم ، وعند الإجابه الصحيحه تحصل على نقطه وعند الحصول على نقطتين تستطيع طرد احدى المشاركين」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف30":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「صراع الآباطرة」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「عبارة عن فريقين بشعاران مختلفان ( ♣️ ، ♦️ ) وتبدا الفعالية والفريق الذي يجيب على السؤال يكتب *توم ارمي النرد* وراح يطلع له رقم عشوائي من 1-10 والفريق الذي يوصل 100 نقطة اول هو الفائز」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف31":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「سلب الكرات」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「عبارة عن فريقين ( فريق كرة قدم ⚽️ ، فريق كرة سلة 🏀 ) وكل فريق لديه 10 كور والفريق الذي يجيب بشكل صحيح يستطيع حذف كرة من الفريق الثاني ، واول فريق تخلص كوره يعتبر هو الفريق الخسران.」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ف32":
            formText = `┐═━━━━✥◈✥━━━━═┌

  ⚜︎♟️تـعـلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 عـن :-

    ⚜︎ 🎪┊ *فـعـالـيـة* ┊🎪 ⚜︎

━━━─── • ───━━━
❁ 🧧┊اسـم الـفـعـاليـة :- 
 »「التعداد」

•┈「❁」┈•
❁ 📄┊شــرح الـفـعـاليـة :- 
 »「المقدم يجيب اسم انمي او صفه مثل ( لون الشعر او لون العين او استخدام السيف ) ويحدد كم شخصية يجيبون واول شخص يجيب يحصل على نقطه وعند الحصول على نقطتين يقدر يطرد واحد من المشاركين」

•┈「❁」┈•
❁ 📑┊مـعلـومـات الـفـعـاليـة :

❁🎙️┊الـمـقـدم »「」

❁ ⏱️┊الـوقـت »「」

❁ 🧮┊الـعدد المطلوب »「」

━━━─── • ───━━━

         ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞

┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ا1":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعلان تغيير لقب┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 🧭┋تغـيير من • 〘〙*

*✧ 🛎️┋تغيير إلى • 〘〙*

*✧ 📧┋الــمـنشـن • 〘〙*

*✧ 💸┋خــــصــم • 〘〙*

*✧ 🧑🏻‍💻┋المـسؤول • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا2":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعــــلان انــــذار ┋◆  
━─┄⊹⊱ «◈» ⊰⊹┄─━

✧ 🎫┋اللـقـــب •〘〙

✧ 📧┋الـمنشـن •〘〙

✧ ⚖️┋الـسبــب •〘〙

✧ 💸┋خــصــم •〘〙

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا3":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋اعـلانـ🚫ـــطـرد┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 👤┋المطرود • 〘〙*

*✧ 📧┋المــنشن • 〘〙*

*✧ ❓┋الـسـبـب • 〘〙*

*✧ 📓┋العــقوبه • 〘〙*

 ━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا4":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋اعلانـ💸ـتحويل┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 📤┋الـمحول • 〘〙*

*✧ 💸┋الـمـبلــغ • 〘〙*

*✧ 📥┋المستلم • 〘〙*

*✧ 💌┋رسـالــة • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا5":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعلان حذف انذار┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 👤┋اللقــب • 〘〙*

*✧ 📧┋المنشن • 〘〙*

*✧ 💸┋القـيمة • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا6":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋اعلانــ💳ــشـراء┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 👤┋المشتري • 〘〙*

*✧ 🎟️┋السلـــعة • 〘〙*

*✧ 💸┋خــصـــم • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا7":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعــلان تـرقــيـه ┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧⚜️┋ تـرقـيـه •〘〙*

*✧♟️┋المنشن  •〘〙*

*✧🔅┋ مـــــن •〘〙*

*✧🎗️┋ الــــى •〘〙*

 ━─┄⊹⊱ «◈» ⊰⊹┄─━

نـتمنى كـل التوفـيق لـه فـي
مسـيـرتـه لتـطـويـر الـنقابة..✨🤍

 ━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا8":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعــلان تـخفـيـض┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧⚜️┋تخفيض •〘〙*

*✧♟️┋المنشن  •〘〙*

*✧🔅┋ مـــــن •〘〙*

*✧🎗️┋ الــــى •〘〙*

 ━─┄⊹⊱ «◈» ⊰⊹┄─━

شاكرين له على الجهد الذي 
قدمه من أجل النقابة 🎐🤍

 ━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا9":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏
   
◆┋إعلان حجز لقب┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 👤┋الــحاجــز • 〘〙*

*✧ 🎐┋الـلــقــب • 〘〙*

*✧ 🧭┋الـــوقــت • 〘〙*

*✧ 💵┋الــقـيـمـة • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا10":
            formText = `╮────⊱❁⊰🌨️⊱❁⊰────╭

   ❁ 🛎️ |  مهام المشرفين | 🛎️ ❁

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪  | @ ❫

 ◈ |1|  
 ◈ |2| 
 ◈ |3| 
*⊹──⊱🌨️⊰──⊹*
❁ 📯 ❪ | @ ❫

 ◈ |1|  
 ◈ |2| 
 ◈ |3| 
 *⊹──⊱🌨️⊰──⊹*
❁ 📯 ❪ | @ ❫

 ◈ |1|  
 ◈ |2| 
 ◈ |3| 
*⊹──⊱🌨️⊰──⊹*
 ❁ 📯 ❪  | @ ❫

 ◈ |1|  
 ◈ |2| 
 ◈ |3| 
*⊹──⊱🌨️⊰──⊹*
 ❁ 📯 ❪  | @  ❫

 ◈ |1|  
 ◈ |2| 
 ◈ |3| 
*⊹──⊱🌨️⊰──⊹*
 ❁ 📯 ❪ | @ ❫

 ◈ |1|  
 ◈ |2| 
 ◈ |3| 
 
 ╯────⊱❁⊰🌨️⊱❁⊰────╰
`;
            break;

        case "بيتا_ا11":
            formText = `╮────⊱❁⊰🌨️⊱❁⊰────╭

❁ ⚜️ | تـقـيـيـم الـمـشـرفـيـن | ⚜️ ❁

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*✧ التقييم • 〘〙*
*✧ الراتـب • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*✧ التقييم • 〘〙*
*✧ الراتـب • 〘〙*

*⊹────⊱🌨️⊰────⊹*

❁ 📯 ❪ | @ ❫

*✧ التقييم • 〘〙*
*✧ الراتـب • 〘〙*

*⊹────⊱🌨️⊰────⊹*

❁ 📯 ❪ | @ ❫

*✧ التقييم • 〘〙*
*✧ الراتـب • 〘〙*

*⊹────⊱🌨️⊰────⊹*

❁ 📯 ❪ | @ ❫

*✧ التقييم • 〘〙*
*✧ الراتـب • 〘〙*

*⊹────⊱🌨️⊰────⊹*

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

 ╯────⊱❁⊰🌨️⊱❁⊰────╰
`;
            break;

        case "بيتا_ا12":
            formText = `══════ ✥.🌨️.✥ ══════
  
 ⚜︎ 🛡️┊❪ تعلن إدارة 𝑺𝒑𝒂𝒓𝒕𝒂 ❫

                °•عـ🗞️ــن•° 

  📯┊«مـ♔︎ـلوك الأسبُوع»┊📯 

╭──〔❨🌨️ 𝑺𝒑𝒂𝒓𝒕𝒂 🌨️❩〕──╮

•┈┈┈「❁」┈┈┈•
❁ 👑┊❪ المشرف الذهبي ❫
-﹝﹞

*_❁الجائزه_* ﹝250k + ⭐️﹞

•┈┈┈「❁」┈┈┈•
❁ ⚜️┊❪ العضو الذهبي ❫
-﹝﹞

*_❁الجائزه_* ﹝250k + ⭐️﹞

•┈┈┈「❁」┈┈┈•
❁ 📯┊❪ ملك التـفاعـل❫
-﹝﹞

*_❁الجائزه_* ﹝250k + ⭐️﹞

•┈┈┈「❁」┈┈┈•
❁ 🃏┊❪ ملك المسابقات ❫
-﹝﹞

*_❁الجائزه_* ﹝250k + ⭐️﹞

•┈┈┈「❁」┈┈┈•

      〘𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎〙

══════ ✥.🌨️.✥ ══════
`;
            break;

        case "بيتا_ا13":
            formText = `┐═━━━✥◈✥━━━═┌
        
•┊«تـقـريـر النـقـابـة الأسبُوعي»┊•

•┈┈┈「❁」┈┈┈•
❁📈┊❪ تفاعل النقابة ❫
-﹝﹞

❁🎰┊❪ تفاعل الإعلانات ❫
-﹝﹞

❁ 📟┊❪ عدد الأعضاء ❫
-﹝﹞

❁ 📯┊❪ أفضل مشرف ❫
-﹝﹞

❁ 🎗️┊❪ أفضل عضو ❫
-﹝﹞
•┈┈┈「❁」┈┈┈•
 •┊«أخر أخبار النقابة 🗞️»┊•
-﹝﹞
-﹝﹞
-﹝﹞
•┈┈┈「❁」┈┈┈•

    〘𝑺𝒑𝒂𝒓𝒕𝒂 ⊰🛡️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎〙

 ┘═━━━━✥◈✥━━━━═└
`;
            break;

        case "بيتا_ا14":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

📜 | التفاعـل الاسبوعي | 📜
 ━─┄─⊹⊱ «◈» ⊰⊹─┄─━

*✧ 🥇┋الــــاول • 〘〙*

*✧ 🎗️┋التفاعل • 〘〙*

*✧ 💵┋الـجائزه • 〘〙*

┄⟞❲❉❳⟝┄

*✧ 🥇┋الـثــاني • 〘〙*

*✧ 🎗️┋التفاعل • 〘〙*

*✧ 💵┋الـجائزه • 〘〙*

┄⟞❲❉❳⟝┄

*✧ 🥇┋الثــالث • 〘〙*

*✧ 🎗️┋التفاعل • 〘〙*

*✧ 💵┋الجـائزه • 〘〙*

━─┄─⊹⊱ «◈» ⊰⊹─┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا15":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

🎪 | مـلـوك الـمـسـابـقـات | 🎪
━─┄─⊹⊱ «◈» ⊰⊹─┄─━

*✧ 🥇┋المركز الاول • 〘〙*

*✧ 🎗️┋الانتـصـارات • 〘〙*

*✧ 💵┋الــجــائــزه • 〘〙*

┄⟞❲❉❳⟝┄

*✧ 🥇┋المركز الثاني • 〘〙*

*✧ 🎗️┋الانتـصـارات • 〘〙*

*✧ 💵┋الــجــائــزه • 〘〙*


┄⟞❲❉❳⟝┄

*✧ 🥇┋المركز الثالث • 〘〙*

*✧ 🎗️┋الانـتـصـارات • 〘〙*

*✧ 💵┋الــجــائـــزه • 〘〙*

━─┄─⊹⊱ «◈» ⊰⊹─┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا16":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋إعلان شراء روليت┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 👤┋المشتري • 〘⁩〙*

*✧ 🎰┋الرولـيت • 〘〙*

*✧ 💸┋خــصــم • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا17":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋رساله بالاعلانات┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 👤┋المشتري • 〘〙*

*✧ 🖇️┋المــنشن • 〘⁩〙*

*✧ 💸┋خــصــم • 〘〙*

*✧ ✉️┋الـرسالـه • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا18":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋شراء سلعة قتاليه┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧ 👤┋المشتري  • 〘〙*

*✧ 🎎┋الضـحيـة • 〘〙*

*✧ ⚔�️┋الحُـــكـم  • 〘〙*

*✧ 💸┋خـــصــم  • 〘〙*

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا19":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

⚜︎♟️تـعـلن إدارة 𝑨𝒊𝒂𝒓𝒔 عـن :-

◆┋┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━

*❁*「」

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗
`;
            break;

        case "بيتا_ا20":
            formText = `╮────⊱❁⊰🌨️⊱❁⊰────╭

   ❁ 🛎️ | مهام المشرفين الأساسية | 🛎️ ❁

*⊹────⊱🌨️⊰────⊹*

 ◈ 25 سؤال مفاجئ
◈ فعالية
◈ مسابقة
◈ نقاش
◈ إدخال خمس اعضاء من الأستقبال

*⊹──⊱🌨️⊰──⊹*
*❁ 📝┊ملاحظات•*

➀ ستكون هذي المهام على مدار اسبوع.
➁ في حال عدم اكمال المهام سيتم الحصول على انذار اشراف.
➂ المهام تشمل الجميع ماعدا الليدر والنائب.

 ╯────⊱❁⊰🌨️⊱❁⊰────╰
`;
            break;

        case "بيتا_ا21":
            formText = `┓━─┄⊹⊱ «◈» ⊰⊹┄─━┏
        *◞تم تحديث البنك╎🏦◜*

✧ مسؤول البنك🧑‍💻 *『』*

✧ رابط البنك 🏦 
‏⊏ https://bit.ly/48QqqfO ⊐‏

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛━─┄⊹⊱ «◈» ⊰⊹┄─━┗
`;
            break;

        case "بيتا_ا22":
            formText = `╮────⊱❁⊰🌨️⊱❁⊰────╭

❁ ⚜️ | تفاعل المشرفين الأسبوعي | ⚜️ ❁

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*
❁ 📯 ❪ | @ ❫

*◈ الأسـاسـي • 〘〙*
*◈ الإعـلانـات • 〘〙*
*◈ الإسـتقبـال • 〘〙*
*◈ الاســئـلــة • 〘〙*
*◈ الفعـاليـات • 〘〙*
*◈ المسابقات • 〘〙*
*◈ النقـاشـات • 〘〙*
*◈ الأعــضــاء • 〘〙*

*⊹────⊱🌨️⊰────⊹*

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

 ╯────⊱❁⊰🌨️⊱❁⊰────╰`;
            break;

        case "بيتا_ا23":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

تجيب تقييم 15 ذا يعطيك فرصة للترقية 

مسؤول البنك +2 تقييم 
مسؤول المنشن +2 تقييم 

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 15
الراتب : 400k

رسائل الاساسي 10k
رسائل الاعلانات 160
رسائل الاستقبال 500

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم  14
الراتب 350k

رسائل الاساسي 9k
رسائل الاعلانات 160
رسائل الاستقبال 500

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 13
الراتب : 300k

رسائل الاساسي 8k
رسائل الاعلانات 150
رسائل الاستقبال 400

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 12
الراتب : 250k

رسائل الاساسي 7k
رسائل الاعلانات 150
رسائل الاستقبال 350

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 11
الراتب : 230k

رسائل الاساسي  6k
رسائل الاعلانات 130
رسائل الاستقبال 250

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 10 
الراتب : 200k

رسائل الاساسي 5k 
رسائل الاعلانات 120
رسائل الاستقبال 200

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 9 
الراتب : 170k

رسائل الاساسي 4k
رسائل الاعلانات 100
رسائل الاستقبال 150

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 8
الراتب : 150k

رسائل الاساسي 3k
رسائل الاعلانات 70
رسائل الاستقبال 110

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 7
الراتب : 130k

رسائل الاساسي 2k
رسائل الاعلانات 50
رسائل الاستقبال 90

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 6 
الراتب : 100k

رسائل الاساسي 1k
رسائل الاعلانات 30
رسائل الاستقبال 60

━─┄⊹⊱ «◈» ⊰⊹┄─━

تقييم 5 الي هو انذار

رسائل الاساسي اقل من500
رسائل الاعلانات اقل من15
رسائل الاستقبال اقل من40

━─┄⊹⊱ «◈» ⊰⊹┄─━

سحب الاشراف

رسائل الاساسي اقل من 100
رسائل الاعلانات اقل من5
رسائل الاستقبال اقل من20

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗`;
            break;

        case "قوانين":
            formText = `┓═━─┄⊹⊱ «◈» ⊰⊹┄─━═┏

◆┋قوانينـ🌨️𝑺𝒑𝒂𝒓𝒕𝒂┋◆
━─┄⊹⊱ «◈» ⊰⊹┄─━ 

*✧⛔┋قسم التنبيه :-*

✧ إهانة الأعضاء او المشرفين. 

✧ الخروج من دون سبب والعودة بشكل متكرر.

✧ افتعال مشاكل (غير الميانة).

✧ التدخل في شؤون المشرفين.

✧ التحدث عن حلقة لم يمر على نزولها 12 ساعة.

✧ إرسال صور أو مقاطع وقت المسابقة.

✧ عمل السبام.
(السبام أكثر من أربع رسائل بلا فائد) 

✧ التكلم بلغة غير العربية العامة.

✧تسجيل الفويس ل البنات.

✧ طلب الإشراف(بالخاص او العام).

━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧⛔┋قسم الانذار :-*

✧ التشبيك. 

✧ إرسال ملصق مخل او دموي.

✧ العنصرية بشكل عام.

✧ الحرق بكل انواعه(بالخاص او العام).

✧ التشفير( على حسب الشي المشفر )

✧ ارسال اصوات صاخبة و مخلة.

✧ التحدث عن المثليين وكل ما يخصهم.

✧ عمل اسبام بشكل كبير.

✧ ارسال فضايح استفزازية

✧ انتحال شخصية غير شخصيتك.

✧ عدم اعطاء لقبك للمشرف.

✧ ارسال روابط مقاطع(ما يكون نشر)

━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧⛔┋قسم الانذارين :-*

✧ التكلم عن ماحرم الله.

✧ استخدام منشن القروب من قبل العضو.

✧ تصبيع.

✧ التحدث في الدين والسياسة.

━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧⛔┋قسم الطرد التاديبي :-*

✧ ارسال صور شخصية لك او لصاحبك 

✧ الإزعاج بشكل ملحوظ .

✧ التهديد بالفايروس او الباند.

✧ الإعتراض على قانون او حُكم.

✧ الصور والفيديوهات والكلام الغير لائق.

━─┄⊹⊱ «◈» ⊰⊹┄─━

*✧⛔┋قسم الطرد مؤبد :-*

✧ سرقه الاستمارات او الاعضاء.

✧ الفايروس او الباند.

✧ النشر بشكل عام(بالخاص او العام). 

✧ الحديث المنحرف و العياذ بالله.

✧ عدم احترام الكلمات الي بتدل على الله عز وجل.

✧ القذف.

✧ الإحتكاك الغير لائق (بالخاص او العام). 

━─┄⊹⊱ «◈» ⊰⊹┄─━

✧📝┃مـلاحـظـات.

「➀」تنبيهن= انذار.
「➁」ثلاث انذارات  = تأديبي ليومين.

━─┄⊹⊱ «◈» ⊰⊹┄─━

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞

┛═━─┄⊹⊱ «◈» ⊰⊹┄─━═┗`;
            break;

        default:
            return;
    }

    
    if (!formText1 || formText1.trim() === "") {
        // إرسال الرسالة الأولى فقط
        await conn.sendMessage(m.chat, { text: formText }, { quoted: m });
    } else {
        // إرسال كلتا الرسالتين
        await conn.sendMessage(m.chat, { text: formText }, { quoted: m });
        await conn.sendMessage(m.chat, { text: formText1 }, { quoted: m });
    }
};

handler.command = ["received_message", "بيتا_ترحيب", "استمارة", "استماره", "بيتا_حسبة", "بيتا_01", "بيتا_02", "بيتا_03", "بيتا_س1", "بيتا_ج1", "بيتا_سؤال_ديني", "بيتا_نقاش", "بيتا_انتهى", "شرح", "بيتا_مسابقة", "بيتا_نتائج", "بيتا_فعالية", "بيتا_جوائز", "بيتا_فرق", "بيتا_مشاركين", "بيتا_ف1", "بيتا_ف2", "بيتا_ف3", "بيتا_ف4", "بيتا_ف5", "بيتا_ف6", "بيتا_ف7", "بيتا_ف8", "بيتا_ف9", "بيتا_ف10", "بيتا_ف11", "بيتا_ف12", "بيتا_ف13", "بيتا_ف14", "بيتا_ف15", "بيتا_ف16", "بيتا_ف17", "بيتا_ف18", "بيتا_ف19", "بيتا_ف20", "بيتا_ف21", "بيتا_ف22", "بيتا_ف23", "بيتا_ف24", "بيتا_ف25", "بيتا_ف26", "بيتا_ف27", "بيتا_ف28", "بيتا_ف29", "بيتا_ف30", "بيتا_ف31", "بيتا_ف32", "بيتا_ا1", "بيتا_ا2", "بيتا_ا3", "بيتا_ا4", "بيتا_ا5", "بيتا_ا6", "بيتا_ا7", "بيتا_ا8", "بيتا_ا9", "بيتا_ا10", "بيتا_ا11", "بيتا_ا12", "بيتا_ا13", "بيتا_ا14", "بيتا_ا15", "بيتا_ا16", "بيتا_ا17", "بيتا_ا18", "بيتا_ا19", "بيتا_ا20", "بيتا_ا21", "بيتا_ا22", "بيتا_ا23", "قوانين"];

export default handler;
