import { generateWAMessageFromContent } from 'baileys';

let handler = async (m, { conn }) => {
    const interactiveMessage = {
        header: {
            title: `*❃ ───────⊰ ❀ ⊱─────── ❃*
        
⚜︎🛎️┊استمارات البطولات┊🛎️⚜︎

*❃ ───────⊰ ❀ ⊱─────── ❃*


 ⚜︎┊ا استمارة *فعالية الصور* اطلب 
✧بيتا ف1
    
❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *فعالية تحدي فردي* اطلب 
✧بيتا ف2 

❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *فعالية الساحة* اطلب 
✧بيتا ف3

❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *فعالية الزومبي* اطلب 
✧بيتا ف4 

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية كرسي الاعتراف* اطلب 
✧بيتا ف5
  
❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *فعالية روليت الأسئلة* اطلب 
✧بيتا ف6
  
❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *فعالية تحدي سبام* اطلب 
✧بيتا ف7

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعالية القلوب* اطلب 
✧بيتا ف8

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعالية الكنز* اطلب 
✧بيتا ف9

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعالية الطرد* اطلب 
✧بيتا ف10

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعالية ديث نوت* اطلب 
✧بيتا ف11

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعالية قتال العظماء* اطلب 
✧بيتا ف12

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعاليه البكتيريا* اطلب 
✧بيتا ف13

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعاليه المنشن* اطلب 
✧بيتا ف14

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعاليه الادت* اطلب 
✧بيتا ف15
❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *فعاليه الاجراس* اطلب 
✧بيتا ف16

❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *فعالية الابواب* اطلب
✧بيتا ف17

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية واقف جالس* اطلب
✧بيتا ف18

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية القدرات* اطلب
✧بيتا ف19

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية القلاع* اطلب
✧بيتا ف20

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية الكيرا* اطلب
✧بيتا ف21

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *البقاء للأقوى* اطلب
✧بيتا ف22

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية المارد الازرق* اطلب
✧بيتا ف23

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية الجواهر* اطلب
✧بيتا ف24

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية الميمز* اطلب
✧بيتا ف25

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية إكس آو* اطلب
✧بيتا ف26

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية الكلانات* اطلب
✧بيتا ف27

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية مصاص الدماء* اطلب
✧بيتا ف28

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية المعرفة* اطلب
✧بيتا ف29

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية صراع الآباطرة* اطلب
✧بيتا ف30

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية سلب الكرات* اطلب
✧بيتا ف31

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *فعالية التعداد* اطلب
✧بيتا ف32

❃ ───────⊰ ❀ ⊱─────── ❃
          
        ﹝𝑺𝒑𝒂𝒓𝒕𝒂 ⊰️⊱ 𝑲𝒊𝒏𝒈𝒅𝒐𝒎﹞
`,
        },
        body: {
            text: '*❃ ───────⊰ ❀ ⊱─────── ❃*\n',
        },
        nativeFlowMessage: {
            buttons: [
                {
                    name: 'single_select',
                    buttonParamsJson: JSON.stringify({
                        title: '❀ الاقسام ❀',
                        sections: [
                            {
                                title: 'الاستمارات',
                                highlight_label: 'آرثر',
                                rows: [
                                    { header: '❀ فعالية الصور ❀', title: 'بيتا ف1', id: '.بيتا_ف1' },
                                    { header: '❀ تحدي فردي ❀', title: 'بيتا ف2', id: '.بيتا_ف2' },
                                    { header: '❀ الساحة ❀', title: 'بيتا ف3', id: '.بيتا_ف3' },
                                    { header: '❀ الزومبي ❀', title: 'بيتا ف4', id: '.بيتا_ف4' },
                                    { header: '❀ كرسي الاعتراف ❀', title: 'بيتا ف5', id: '.بيتا_ف5' },
                                    { header: '❀ روليت الأسئلة ❀', title: 'بيتا ف6', id: '.بيتا_ف6' },
                                    { header: '❀ تحدي سبام ❀', title: 'بيتا ف7', id: '.بيتا_ف7' },
                                    { header: '❀ القلوب ❀', title: 'بيتا ف8', id: '.بيتا_ف8' },
                                    { header: '❀ الكنز ❀', title: 'بيتا ف9', id: '.بيتا_ف9' },
                                    { header: '❀ الطرد ❀', title: 'بيتا ف10', id: '.بيتا_ف10' },
                                    { header: '❀ ديث نوت ❀', title: 'بيتا ف11', id: '.بيتا_ف11' },
                                    { header: '❀ قتال العظماء ❀', title: 'بيتا ف12', id: '.بيتا_ف12' },
                                    { header: '❀ البكتيريا ❀', title: 'بيتا ف13', id: '.بيتا_ف13' },
                                    { header: '❀ المنشن ❀', title: 'بيتا ف14', id: '.بيتا_ف14' },
                                    { header: '❀ الادت ❀', title: 'بيتا ف15', id: '.بيتا_ف15' },
                                    { header: '❀ الاجراس ❀', title: 'بيتا ف16', id: '.بيتا_ف16' },
                                    { header: '❀ الابواب ❀', title: 'بيتا ف17', id: '.بيتا_ف17' },
                                    { header: '❀ واقف جالس ❀', title: 'بيتا ف18', id: '.بيتا_ف18' },
                                    { header: '❀ القدرات ❀', title: 'بيتا ف19', id: '.بيتا_ف19' },
                                    { header: '❀ القلاع ❀', title: 'بيتا ف20', id: '.بيتا_ف20' },
                                    { header: '❀ الكيرا ❀', title: 'بيتا ف21', id: '.بيتا_ف21' },
                                    { header: '❀ البقاء للأقوى ❀', title: 'بيتا ف22', id: '.بيتا_ف22' },
                                    { header: '❀ المارد الازرق ❀', title: 'بيتا ف23', id: '.بيتا_ف23' },
                                    { header: '❀ الجواهر ❀', title: 'بيتا ف24', id: '.بيتا_ف24' },
                                    { header: '❀ الميمز ❀', title: 'بيتا ف25', id: '.بيتا_ف25' },
                                    { header: '❀ إكس آو ❀', title: 'بيتا ف26', id: '.بيتا_ف26' },
                                    { header: '❀ الكلانات ❀', title: 'بيتا ف27', id: '.بيتا_ف27' },
                                    { header: '❀ مصاص الدماء ❀', title: 'بيتا ف28', id: '.بيتا_ف28' },
                                    { header: '❀ المعرفة ❀', title: 'بيتا ف29', id: '.بيتا_ف29' },
                                    { header: '❀ صراع الآباطرة ❀', title: 'بيتا ف30', id: '.بيتا_ف30' },
                                    { header: '❀ سلب الكرات ❀', title: 'بيتا ف31', id: '.بيتا_ف31' },
                                    { header: '❀ التعداد ❀', title: 'بيتا ف32', id: '.بيتا_ف32' },
                                ],
                            },
                        ],
                    }),
                    messageParamsJson: '',
                },
            ],
        },
    };

    let msg = generateWAMessageFromContent(
        m.chat,
        {
            viewOnceMessage: {
                message: {
                    interactiveMessage,
                },
            },
        },
        { userJid: conn.user.jid, quoted: m }
    );

    conn.relayMessage(m.chat, msg.message, { messageId: msg.key.id });
};

handler.help = ['info'];
handler.tags = ['main'];
handler.command = ['بيتا2'];

export default handler;

