import { prepareWAMessageMedia, generateWAMessageFromContent } from 'baileys';

let handler = async (m, { conn }) => {  
    // إنشاء الرسالة التفاعلية بدون صورة  
    const interactiveMessage = {  
        header: {  
            title: `*❃ ───────⊰ ❀ ⊱─────── ❃*

◆┋أستماراتـ الأساسيه┋◆

 *❃ ───────⊰ ❀ ⊱─────── ❃*

 ⚜︎┊ا استمارة *سؤال مفاجئ*  اطلب 
✧ بيتا س1      
    
❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *الإجابة*  اطلب 
✧ بيتا ج1 

❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *المسابقة*  اطلب 
✧ بيتا مسابقة

❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *النتائج*  اطلب 
✧ بيتا نتائج 

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *الفعاليات*  اطلب 
✧ بيتا فعالية
 
❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *جوائز*  اطلب 
✧ بيتا جوائز 
  
❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊ا استمارة *جوائز الفرق* اطلب
✧بيتا فرق

❃ ───────⊰ ❀ ⊱─────── ❃

 ⚜︎┊ا استمارة *المشاركين*  اطلب 
✧ بيتا مشاركين 

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *نقاش*  اطلب 
✧ بيتا نقاش 

❃ ───────⊰ ❀ ⊱─────── ❃

  ⚜︎┊ا استمارة *إنتهى النقاش*  اطلب 
✧ بيتا انتهى 

❃ ───────⊰ ❀ ⊱─────── ❃

⚜︎┊استمارة *سؤال ديني*  اطلب
✧ بيتا سؤال ديني

📜 *أختر من الأقسام ما يناسبك*

*❃ ───────⊰ ❀ ⊱─────── ❃*

*⚜︎ 📯 ┃ادارة•* ﹝𝑺𝒑𝒂𝒓𝒕𝒂﹞`,  
        },  
        body: {  
            text: '*❃ ───────⊰ ❀ ⊱─────── ❃*\n',  
        },  
        nativeFlowMessage: {  
            buttons: [  
                {  
                    name: 'single_select',  
                    buttonParamsJson: JSON.stringify({  
                        title: '❀ الاقسام ❀',  
                        sections: [  
                            {  
                                title: 'الاستمارات',  
                                highlight_label: 'آرثر',  
                                rows: [  
                                    { header: '❀ سؤال مفاجئ ❀', title: 'بيتا س1', id: '.بيتا_س1'},  
                                    { header: '❀ الإجابة ❀', title: '❃ بيتا ج1 ❃', id: '.بيتا_ج1' },  
                                    { header: '❀ المسابقة ❀', title: '❃ بيتا مسابقة ❃', id: '.بيتا_مسابقة' },  
                                    { header: '❀ النتائج ❀', title: '❃ بيتا نتائج ❃', id: '.بيتا_نتائج' },  
                                    { header: '❀ الفعاليات ❀', title: '❃ بيتا فعالية ❃', id: '.بيتا_فعالية' },  
                                    { header: '❀ جوائز ❀', title: '❃ بيتا جوائز ❃', id: '.بيتا_جوائز' },  
                                    { header: '❀ جوائز الفرق ❀', title: '❃ بيتا فرق ❃', id: '.بيتا_فرق' },  
                                    { header: '❀ المشاركين ❀', title: '❃ بيتا مشاركين ❃', id: '.بيتا_مشاركين' },  
                                    { header: '❀ نقاش ❀', title: '❃ بيتا نقاش ❃', id: '.بيتا_نقاش' },  
                                    { header: '❀ بيتا انتهى ❀', title: '❃ إنتهى النقاش ❃', id: '.إنتهى_النقاش' },  
                                    { header: '❀ سؤال ديني ❀', title: '❃ بيتا سؤال ديني ❃', id: '.بيتا_سؤال_ديني' },  
                                ],  
                            },  
                        ],  
                    }),  
                    messageParamsJson: '',  
                },  
            ],  
        },  
    };  

    // إنشاء الرسالة  
    let msg = generateWAMessageFromContent(  
        m.chat,  
        {  
            viewOnceMessage: {  
                message: {  
                    interactiveMessage,  
                },  
            },  
        },  
        { userJid: conn.user.jid, quoted: m }  
    );  

    // إرسال الرسالة  
    conn.relayMessage(m.chat, msg.message, { messageId: msg.key.id });  
};  

handler.help = ['info'];  
handler.tags = ['main'];  
handler.command = ['بيتا1'];  

export default handler;
