let handler = async (m, { conn, text }) => {
  const tag = '@' + m.sender.split('@')[0]; // عشان يذكر الضحية
  const response =
    `*❀ ───────⊰ ꪆৎ ⊱─────── ❀*\n\n` +
    `*تم اختراق الضحية ${tag} بنجاح*✅\n` +
    `*هايسو تسلم عليك 🔒*\n\n` +
    `*❀ ───────⊰ ꪆৎ ⊱─────── ❀*`;    

  async function loading() {
    var hawemod = [
      "*جاري الاختراق*",
      "*جاري تحميل الاختراق* 《 ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒》 0%",
      "*جاري تحميل الصور* 《 █▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒》10%",
      "*تم تحميل الصور* 《 ██▒▒▒▒▒▒▒▒▒▒▒▒▒▒》20%",
      "*جاري تحميل الفيديوهات* 《 ███▒▒▒▒▒▒▒▒▒▒▒▒▒》30%",
      "*تم تحميل الفيديوهات* 《 ████▒▒▒▒▒▒▒▒▒▒▒▒》40%",
      "*جاري تحميل الاصوات* 《 █████▒▒▒▒▒▒▒▒▒▒▒》50%",
      "*تم تحميل الاصوات* 《 ██████▒▒▒▒▒▒▒▒▒▒》60%",
      "*جاري تحميل الملفات* 《 ███████▒▒▒▒▒▒▒▒▒》70%",
      "*تم تحميل الملفات* 《 ████████▒▒▒▒▒▒▒▒》80%",
      "*جاري تحميل محادثات واتساب* 《 █████████▒▒▒▒▒▒▒》90%",
      "*تم تحميل محادثات واتساب* 《 ███████████▒▒▒▒▒》92%",
      "*يتم تحميل الاختراق جاري رفع الاختراق علي السيرفر* 《 ███████████▒▒▒▒▒》95%",
      "*تم الاتصال بجهاز الضحيه يتم تحميل البيانات* 《 ███████████▒▒▒▒▒》96%",
      "*اختراق الضحيه 100% اكتمل جاري جمع جميع الادله* 《 ████████████▒▒▒▒》97%",
      "*اكتمل الاختراق* ✅ 《 ████████████████》100%",
      "*جاري حفظ بيانات الضحيه* ⌛",
      "*تم حفظ بيانات الضحيه بنجاح* ✅"
    ];

    // أرسل الرسالة الأولى
    let msg = await conn.sendMessage(m.chat, { text: hawemod[0], mentions: [m.sender] }, { quoted: m });

    // عدل نفس الرسالة بالترتيب كل فترة عشوائية
    for (let i = 1; i < hawemod.length; i++) {
      // وقت عشوائي بين 1–3 ثواني
      let delay = Math.floor(Math.random() * 2000) + 1000; 
      await new Promise(resolve => setTimeout(resolve, delay));

      await conn.relayMessage(
        m.chat,
        {
          protocolMessage: {
            key: msg.key,
            type: 14,
            editedMessage: {
              conversation: hawemod[i],
            },
          },
        },
        {}
      );
    }

    // النتيجة النهائية
    await conn.sendMessage(m.chat, { text: response, mentions: [m.sender] }, { quoted: m });         
  }

  loading();
};

handler.help = ['love'];
handler.tags = ['fun'];
handler.command = /^(تهكير|هكر)$/i;
handler.rowner = true;

export default handler;