let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*❀ ───────⊰ ꪆৎ ⊱─────── ❀*\n\n*『${pickRandom(global.bjssvjs)}』*\n\n*❀ ───────⊰ ꪆৎ ⊱─────── ❀*`, m)
}
handler.help = ['uwvssj']
handler.tags = ['fun']
handler.command = /صراحه|صراحة|الصراحه/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.bjssvjs = [
  "صراحة | هل تعتبر نفسك شخص غيور؟",
  "صراحة | ما أكثر شيء تفكر فيه هذه الأيام؟",
  "صراحة | هل تفضل الوحدة أم الرفقة؟",
  "صراحة | هل تعبر عن مشاعرك بسهولة؟",
  "صراحة | هل سامحت شخصًا خانك من قبل؟",
  "صراحة | هل سبق وأن خذلت شخصًا مقربًا منك؟",
  "صراحة | هل لديك حلم تخاف أن تسعى لتحقيقه؟",
  "صراحة | ما أكثر شيء تخاف فقدانه؟",
  "صراحة | هل تثق في الناس بسهولة؟",
  "صراحة | من الشخص الذي لا تستطيع رفض طلبه؟",
  "صراحة | هل مررت بعلاقة ندمت عليها؟",
  "صراحة | متى كانت آخر مرة بكيت فيها؟",
  "صراحة | ما أكثر شيء تندم عليه؟",
  "صراحة | هل تحب المفاجآت؟",
  "صراحة | هل تعتقد أن المال يشتري السعادة؟",
  "صراحة | هل لديك سر لا يعرفه أحد؟",
  "صراحة | من أكثر شخص تفكر فيه يوميًا؟",
  "صراحة | هل تحب المغامرة أم تفضل الأمان؟",
  "صراحة | هل سبق وأن كذبت لإنقاذ موقف؟",
  "صراحة | كيف تتصرف عندما تغضب؟",
  "صراحة | هل تحب أن تعيش في الماضي أم المستقبل؟",
  "صراحة | لو أُتيحت لك الفرصة لتغيير شيء في حياتك، ما هو؟",
  "صراحة | هل أنت راضٍ عن نفسك حاليًا؟",
  "صراحة | ما هو أكثر موقف غير حياتك؟",
  "صراحة | من الشخص الذي يشكل نقطة ضعفك؟",
  "صراحة | هل تحب العمل ضمن فريق أم بشكل فردي؟",
  "صراحة | هل سبق وتعرضت للخذلان من أقرب الناس؟",
  "صراحة | كيف تتعامل مع من يخذلك؟",
  "صراحة | هل تؤمن بالحظ أم بالاجتهاد؟",
  "صراحة | ما هو أكبر إنجاز في حياتك؟",
  "صراحة | هل تخفي مشاعرك أم تظهرها؟",
  "صراحة | هل تعتذر إذا أخطأت؟",
  "صراحة | هل تثق بنفسك؟",
  "صراحة | ما هو تعريفك للسعادة؟",
  "صراحة | هل تندم على شيء لم تفعله؟",
  "صراحة | لو خيروك بين الحب والكرامة، ماذا تختار؟",
  "صراحة | ما الشيء الذي لا يمكنك الاستغناء عنه؟",
  "صراحة | هل تعتبر نفسك محظوظًا؟",
  "صراحة | ما أكثر صفة تحبها في شخصيتك؟",
  "صراحة | هل تعطي فرصًا ثانية؟",
  "صراحة | هل تهتم برأي الناس فيك؟",
  "صراحة | هل شعرت يومًا بأنك غير مفهوم؟",
  "صراحة | ما هو الشيء الذي تود تغييره في شخصيتك؟",
  "صراحة | هل مررت بحب من طرف واحد؟",
  "صراحة | متى آخر مرة شعرت بالفخر بنفسك؟",
  "صراحة | هل تغار على من تحب؟",
  "صراحة | ما هو أكثر شيء تتمنى تحقيقه قبل أن تموت؟",
  "صراحة | هل يمكنك التضحية من أجل من تحب؟",
  "صراحة | هل لديك صديق مقرب تعرفه منذ الطفولة؟",
];
