let handler  = async (m, { conn }) => {
  conn.reply(m.chat, `*❀ ───────⊰ ꪆৎ ⊱─────── ❀*\n\n*『${pickRandom(global.wisuiska)}』*\n\n*❀ ───────⊰ ꪆৎ ⊱─────── ❀*`, m)
}
handler.help = ['فزوره']
handler.tags = ['fun']
handler.command = /فزوره|فزورة/i
export default handler

function pickRandom(list) {
  return list[Math.floor(Math.random() * list.length)]
}

global.wisuiska = [
  "ايه الحاجه اللي لازم تكسرها قبل ما تستخدها؟",
  "ما هو الحيوان الذي لا يبيض ولا يلد؟",
  "عقرب لا يخاف منه احد وغير مؤذي؟",
  "من هو الانسان الذي قتل ربع سكان العالم؟",
  "ما هو الشيء الذي ترميه قبل أن تستخدمه؟",
  "تأكل ولا تشبع ما هي؟",
  "الماء أبوه، ولكن إذا وضعناه مع الماء يموت؟",
  "ما الشيء الذي كلما أخذت منه كبر؟",
  "أخت خالك ومش خالتك مين هي؟",
  "شيء أمامك ولن تراه؟",
  "من هو الخال الوحيد لأولاد عمتك؟",
  "ما هو الشيء الذي يقرصك دون أن تراه؟",
  "شيء يخترق الزجاج ولا يكسره؟",
  "ما هي الصلاة التي لا نسجد ولا نركع فيها؟",
  "شيء لو وضعته في الثلاجة لا يبرد؟",
  "ما هي السورة التي بدأت وانتهت بالتسبيح؟",
  "ما هي السور التي تسمى بمواقيت الصلاة؟",
  "كم عدد كلمات آية الكرسي؟",
  "ما هي السورة الملقبة بقلب القرآن؟",
  "ما هو الشيء الذي له أربع أرجل ولا يمشي؟",
  "أيهما أثقل: كيلو إسفنج أم كيلو حديد؟",
  "شيء أخف من الريش ولا يمكن الإمساك به طويلاً؟",
  "ما هو الشيء الذي ليس بإنسان ولا حيوان ولا جماد؟",
  "ما هو الشيء الذي يكتب ولا يقرأ؟",
  "ما هو الشيء الذي إذا لمسته أصدر صوتاً؟",
  "ما هو الشيء الذي لا يؤكل في الليل أبداً؟",
  "شيء يتحدث ويتكلم بدون لسان ولا أذنين؟",
  "ما هو الشيء الذي ليس له بداية ولا نهاية؟",
  "فاكهة لونها مثل اسمها؟",
  "شيء ينبض دون أن يكون له قلب فما هو؟",
  "أين يوجد البحر الذي لا يوجد به ماء؟",
  "يسير على الماء ولكنه لا يبتل.. فما هو؟",
  "ما هو الشيء الذي كلما تحرك خسر جزءًا من ذيله؟",
  "ما هو الشيء الذي له رأس ولكن ليس له عين؟",
  "ما هو الشيء الذي يوجد في السماء وإذا أضفنا إليه حرفاً أصبح شيئاً في الأرض؟",
  "ما هو الشيء الذي لا تحب أن تلبسه، وإذا لبسته لا تراه؟",
  "ما هو الشيء الذي عندما يكون لونه أسود لا ينفع، وعندما يكون لونه أحمر ينفع؟",
  "من هو الشخص الذي يكون ابن أمك وأبيك ولكن ليس أخيك؟",
  "من هو الذي مات ولم يولد؟",
  "ما هو الشيء الذي إن غليته جمد؟",
  "ما هو الشيء الذي تأكل منه رغم أنه لا يؤكل؟",
  "ما هو الشيء الذي كلما زاد نقص؟",
  // فوازير إضافية:
  "ما هو الشيء الذي إذا وضعته في الماء لا يبتل؟",
  "ما هو الشيء الذي تراه في الليل ثلاث مرات وفي النهار مرة واحدة؟",
  "ما هو الشيء الذي يسمع بلا أذن ويتكلم بلا لسان؟",
  "ما هو الشيء الذي له أوراق وليس نبات، وله جلد وليس حيوان، ويعلم وليس إنسان؟",
  "أين يأتي الخميس قبل الأربعاء؟"
]
